export const API_BASE_URL = "http://localhost:8000/api";

export const JWT_EXPIRATION_DATE = Date.now() + 90 * 24 * 60 * 60 * 1000;

export const JWT_SECRET_KEY = "a97f1ee7-5a7d-4937-b7c9-1ef2753d3500";

export const provincesArr = [
  "آذربایجان شرقی",
  "آذربایجان غربی",
  "اردبیل",
  "اصفهان",
  "البرز",
  "ایلام",
  "بوشهر",
  "تهران",
  "چهارمحال و بختیاری",
  "خراسان جنوبی",
  "خراسان رضوی",
  "خراسان شمالی",
  "خوزستان",
  "زنجان",
  "سمنان",
  "سیستان و بلوچستان",
  "فارس",
  "قزوین",
  "قم",
  "کردستان",
  "کرمان",
  "کرمانشاه",
  "کهگیلویه و بویراحمد",
  "گلستان",
  "گیلان",
  "لرستان",
  "مازندران",
  "مرکزی",
  "هرمزگان",
  "همدان",
  "یزد",
];

export const jalaaliMonths: () => string[] = () => {
  return [
    "فروردین",
    "اردیبهشت",
    "خرداد",
    "تیر",
    "مرداد",
    "شهریور",
    "مهر",
    "آبان",
    "آذر",
    "دی",
    "بهمن",
    "اسفند",
  ];
};

export const FILE_BASE_URL = `http://localhost:8000/static`;
